[
  {
    "id": 1,
    "text": "F2F1 \nAfter reviewing the following vulnerability scanning report: \nServer: 192.168.14.6 \nService: Telnet \nPort: 23 Protocol: TCP \nStatus: Open Severity: High \nVulnerability: Use of an insecure network protocol \nAsecurity analyst performs the following test: \nnmap -p 23 192.168.14.6 -- script telnet-encryption \nPORT \n23/tcp \ntelnet encryption: \nTelnet server supports encryption \nSTATE SERVICE REASON \nopen telnet syn-ack \nWhich of the following would the security analyst conclude for this reported \nvulnerability?",
    "options": [
      "It is a false positive.",
      "A rescan is required.",
      "It is considered noise.",
      "Compensating controls exist."
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 2,
    "text": "F2F2 \nAn organization disabled unneeded services and placed a firewall in front of a \nbusiness-critical legacy system. Which of the following best describes the actions taken \nby the organization?",
    "options": [
      "Exception",
      "Segmentation",
      "Risk transfer",
      "Compensating controls"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 3,
    "text": "F2F3 \nA security consultant needs secure, remote access to a client environment. Which of \nthe \nfollowing should the security consultant most likely use to gain access?",
    "options": [
      "EAP",
      "DHCP",
      "IPSec",
      "NAT"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 4,
    "text": "F2F4 \nWhich of the following should a systems administrator use to ensure an easy \ndeployment \nof resources within the cloud provider?",
    "options": [
      "Software as a service",
      "Infrastructure as code",
      "Internet of Things",
      "Software-defined networking"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 5,
    "text": "F2F5 \nAfter a security awareness training session, a user called the IT help desk and reported a \nsuspicious call. The suspicious caller stated that the Chief Financial Officer wanted \ncredit \ncard information in order to close an invoice. Which of the following topics did the user \nrecognize from the training?",
    "options": [
      "Insider threat",
      "Email phishing",
      "Social engineering",
      "Executive whaling"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 6,
    "text": "F2F6 \nA security administrator is deploying a DLP solution to prevent the exfiltration of \nsensitive \ncustomer data. Which of the following should the administrator do first?",
    "options": [
      "Block access to cloud storage websites.",
      "Create a rule to block outgoing email attachments.",
      "Apply classifications to the data.",
      "Remove all user permissions from shares on the file server."
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 7,
    "text": "F2F7 \nAn administrator assists the legal and compliance team with ensuring information about \ncustomer transactions is archived for the proper time period. Which of the following \ndata \npolicies is the administrator carrying out?",
    "options": [
      "Compromise",
      "Retention",
      "Analysis",
      "Transfer",
      "Inventory"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 8,
    "text": "F2F8 \nA company is working with a vendor to perform a penetration test. Which of the following \nincludes an estimate about the number of hours required to complete the engagement?",
    "options": [
      "SOW",
      "BPA",
      "SLA",
      "NDA"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 9,
    "text": "F2F9 \nA Chief Information Security Officer (CISO) wants to explicitly raise awareness about the \nincrease of ransomware-as-a-service in a report to the management team. Which of the \nfollowing best describes the threat actor in the CISO's report?",
    "options": [
      "Insider threat",
      "Hacktivist",
      "Nation-state",
      "Organized crime"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 10,
    "text": "F2F10 \nWhich of the following practices would be best to prevent an insider from introducing \nmalicious code into a company's development process?",
    "options": [
      "Code scanning for vulnerabilities",
      "Open-source component usage",
      "Quality assurance testing",
      "Peer review and approval"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 11,
    "text": "F2F11 \nWhich of the following can best protect against an employee inadvertently installing \nmalware on a company system?",
    "options": [
      "Host-based firewall",
      "System isolation",
      "Least privilege",
      "Application allow list"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 12,
    "text": "F2F12 \nA company is adding a clause to its AUP that states employees are not allowed to modify \nthe operating system on mobile devices. Which of the following vulnerabilities is the \norganization addressing?",
    "options": [
      "Cross-site scripting",
      "Buffer overflow",
      "Jailbreaking",
      "Side loading"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 13,
    "text": "F2F13 \nWhich of the following would be the best ways to ensure only authorized personnel can \naccess a secure facility? (Choose two.)",
    "options": [
      "Fencing",
      "Video surveillance",
      "Badge access",
      "Access control vestibule",
      "Sign-in sheet",
      "Sensor"
    ],
    "correct": [
      2,
      3
    ],
    "multi": true
  },
  {
    "id": 14,
    "text": "F2F14 \nAn organization would like to store customer data on a separate part of the network that \nis \nnot accessible to users on the main corporate network. Which of the following should \nthe \nadministrator use to accomplish this goal?",
    "options": [
      "Segmentation",
      "Isolation",
      "Patching",
      "Encryption"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 15,
    "text": "F2F15 \nWhich of the following is the most common data loss path for an air-gapped network?",
    "options": [
      "Bastion host",
      "Unsecured Bluetooth",
      "Unpatched OS",
      "Removable devices"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 16,
    "text": "F2F16 \nMalware spread across a company's network after an employee visited a compromised \nindustry blog. Which of the following best describes this type of attack?",
    "options": [
      "Impersonation",
      "Disinformation",
      "Watering-hole",
      "Smishing"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 17,
    "text": "F2F17 \nAn organization is struggling with scaling issues on its VPN concentrator and internet \ncircuit due to remote work. The organization is looking for a software solution that will \nallow it to reduce traffic on the VPN and internet circuit, while still providing encrypted \ntunnel access to the data center and monitoring of remote employee internet traffic. \nWhich \nof the following will help achieve these objectives?",
    "options": [
      "Deploying a SASE solution to remote employees",
      "Building a load-balanced VPN solution with redundant internet",
      "Purchasing a low-cost SD-WAN solution for VPN traffic",
      "Using a cloud provider to create additional VPN concentrators"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 18,
    "text": "F2F18 \nWhich of the following is the best reason to complete an audit in a banking \nenvironment?",
    "options": [
      "Regulatory requirement",
      "Organizational change",
      "Self-assessment requirement",
      "Service-level requirement"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 19,
    "text": "F2F19 \nWhich of the following security concepts is the best reason for permissions on a human \nresources fileshare to follow the principle of least privilege?",
    "options": [
      "Integrity",
      "Availability",
      "Confidentiality",
      "Non-repudiation"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 20,
    "text": "F2F20 \nWhich of the following are cases in which an engineer should recommend the \ndecommissioning of a network device? (Choose two.)",
    "options": [
      "The device has been moved from a production environment to a test environment.",
      "The device is configured to use cleartext passwords.",
      "The device is moved to an isolated segment on the enterprise network.",
      "The device is moved to a different location in the enterprise.",
      "The device's encryption level cannot meet organizational standards.",
      "The device is unable to receive authorized updates."
    ],
    "correct": [
      4,
      5
    ],
    "multi": true
  },
  {
    "id": 21,
    "text": "F2F21 \nA company is required to perform a risk assessment on an annual basis. Which of the \nfollowing types of risk assessments does this requirement describe?",
    "options": [
      "Continuous",
      "Ad hoc",
      "Recurring",
      "One time"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 22,
    "text": "F2F22 \nAfter a recent ransomware attack on a company's system, an administrator reviewed the \nlog files. Which of the following control types did the administrator use?",
    "options": [
      "Compensating",
      "Detective",
      "Preventive",
      "Corrective"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 23,
    "text": "F2F23 \nWhich of the following exercises should an organization use to improve its incident \nresponse process?",
    "options": [
      "Tabletop",
      "Replication",
      "Failover",
      "Recovery"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 24,
    "text": "F2F24 \nWhich of the following best ensures minimal downtime and data loss for organizations \nwith critical computing equipment located in earthquake-prone areas?",
    "options": [
      "Generators and UPS",
      "Off-site replication",
      "Redundant cold sites",
      "High availability networking"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 25,
    "text": "F2F25 \nA newly identified network access vulnerability has been found in the OS of legacy loT \ndevices. Which of the following would best mitigate this vulnerability quickly?",
    "options": [
      "Insurance",
      "Patching",
      "Segmentation",
      "Replacement"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 26,
    "text": "F2F26 \nAfter an audit, an administrator discovers all users have access to confidential data on a \nfile server. Which of the following should the administrator use to restrict access to the \ndata quickly?",
    "options": [
      "Group Policy",
      "Content filtering",
      "Data loss prevention",
      "Access control lists"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 27,
    "text": "F2F27 \nA client demands at least 99.99% uptime from a service provider's hosted security \nservices. Which of the following documents includes the information the service \nprovider \nshould return to the client?",
    "options": [
      "MOA",
      "SOW",
      "MOU",
      "SLA"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 28,
    "text": "F2F28 \nA company is discarding a classified storage array and hires an outside vendor to \ncomplete the disposal. Which of the following should the company request from the \nvendor?",
    "options": [
      "Certification",
      "Inventory list",
      "Classification",
      "Proof of ownership"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 29,
    "text": "F2F29 \nA company is planning a disaster recovery site and needs to ensure that a single natural \ndisaster would not result in the complete loss of regulated backup data. Which of the \nfollowing should the company consider?",
    "options": [
      "Geographic dispersion",
      "Platform diversity",
      "Hot site",
      "Load balancing"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 30,
    "text": "F2F30 \nA security analyst locates a potentially malicious video file on a server and needs to \nidentify both the creation date and the file's creator. Which of the following actions \nwould \nmost likely give the security analyst the information required?",
    "options": [
      "Obtain the file's SHA-256 hash.",
      "Use hexdump on the file's contents.",
      "Check endpoint logs.",
      "Query the file's metadata."
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 31,
    "text": "F2F31 \nWhich of the following teams combines both offensive and defensive testing techniques \nto \nprotect an organization's critical systems?",
    "options": [
      "Red",
      "Blue",
      "Purple",
      "Yellow"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 32,
    "text": "F2F32 \nA small business uses kiosks on the sales floor to display product information for \ncustomers. A security team discovers the kiosks use end-of-life operating systems. \nWhich \nof the following is the security team most likely to document as a security implication of \nthe \ncurrent architecture?",
    "options": [
      "Patch availability",
      "Product software compatibility",
      "Ease of recovery",
      "Cost of replacement"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 33,
    "text": "F2F33 \nWhich of the following would help ensure a security analyst is able to accurately \nmeasure \nthe overall risk to an organization when a new vulnerability is disclosed?",
    "options": [
      "A full inventory of all hardware and software",
      "Documentation of system classifications",
      "A list of system owners and their departments",
      "Third-party risk assessment documentation"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 34,
    "text": "F2F34 \nWhich of the following best practices gives administrators a set period to perform \nchanges \nto an operational system to ensure availability and minimize business impacts?",
    "options": [
      "Impact analysis",
      "Scheduled downtime",
      "Backout plan",
      "Change management boards"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 35,
    "text": "F2F35 \nA company must ensure sensitive data at rest is rendered unreadable. Which of the \nfollowing will the company most likely use?",
    "options": [
      "Hashing",
      "Tokenization",
      "Encryption",
      "Segmentation"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 36,
    "text": "F2F36 \nA legacy device is being decommissioned and is no longer receiving updates or patches. \nWhich of the following describes this scenario?",
    "options": [
      "End of business",
      "End of testing",
      "End of support",
      "End of life"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 37,
    "text": "F2F37 \nA bank insists all of its vendors must prevent data loss on stolen laptops. Which of the \nfollowing strategies is the bank requiring?",
    "options": [
      "Encryption at rest",
      "Masking",
      "Data classification",
      "Permission restrictions"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 38,
    "text": "F2F38 \nA company's end users are reporting that they are unable to reach external websites. \nAfter \nreviewing the performance data for the DNS severs, the analyst discovers that the CPU, \ndisk, and memory usage are minimal, but the network interface is flooded with inbound \ntraffic. Network logs show only a small number of DNS queries sent to this server. Which \nof the following best describes what the security analyst is seeing?",
    "options": [
      "Concurrent session usage",
      "Secure DNS cryptographic downgrade",
      "On-path resource consumption",
      "Reflected denial of service"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 39,
    "text": "F2F39 \nA systems administrator wants to prevent users from being able to access data based \non \ntheir responsibilities. The administrator also wants to apply the required access \nstructure \nvia a simplified format. Which of the following should the administrator apply to the site \nrecovery resource group?",
    "options": [
      "RBAC",
      "ACL",
      "SAML",
      "GPO"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 40,
    "text": "F2F40 \nDuring the onboarding process, an employee needs to create a password for an intranet \naccount. The password must include ten characters, numbers, and letters, and two \nspecial characters. Once the password is created, the company will grant the employee \naccess to other company-owned websites based on the intranet profile. Which of the \nfollowing access management concepts is the company most likely using to safeguard \nintranet accounts and grant access to multiple sites based on a user's intranet account? \n(Choose two.)",
    "options": [
      "Federation",
      "Identity proofing",
      "Password complexity",
      "Default password changes",
      "Password manager",
      "Open authentication"
    ],
    "correct": [
      0,
      2
    ],
    "multi": true
  },
  {
    "id": 41,
    "text": "F2F41 \nWhich of the following describes a security alerting and monitoring tool that collects \nsystem, application, and network logs from multiple sources in a centralized system?",
    "options": [
      "SIEM",
      "DLP",
      "IDS",
      "SNMP"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 42,
    "text": "F2F42 \nA network manager wants to protect the company's VPN by implementing multifactor \nauthentication that uses: \nSomething you know - \nSomething you have - \nSomething you are - \nWhich of the following would accomplish the manager's goal?",
    "options": [
      "Domain name, PKI, GeolP lookup",
      "VPN IP address, company ID, facial structure",
      "Password, authentication token, thumbprint",
      "Company URL, TLS certificate, home address"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 43,
    "text": "F2F43 \nWhich of the following would be the best way to handle a critical business application \nthat \nis running on a legacy server?",
    "options": [
      "Segmentation",
      "Isolation",
      "Hardening",
      "Decommissioning"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 44,
    "text": "F2F44 \nWhich of the following vulnerabilities is exploited when an attacker overwrites a register \nwith a malicious address?",
    "options": [
      "VM escape",
      "SQL injection",
      "Buffer overflow",
      "Race condition"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 45,
    "text": "F2F45 \nAfter a company was compromised, customers initiated a lawsuit. The company's \nattorneys have requested that the security team initiate a legal hold in response to the \nlawsuit. Which of the following describes the action the security team will most likely be \nrequired to take?",
    "options": [
      "Retain the emails between the security team and affected customers for 30 days.",
      "Retain any communications related to the security breach until further notice.",
      "Retain any communications between security members during the breach response.",
      "time."
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 46,
    "text": "F2F46 \nWhich of the following describes the process of concealing code or text inside a \ngraphical \nimage?",
    "options": [
      "Symmetric encryption",
      "Hashing",
      "Data masking",
      "Steganography"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 47,
    "text": "F2F47 \nAn employee receives a text message from an unknown number claiming to be the \ncompany's Chief Executive Officer and asking the employee to purchase several gift \ncards. Which of the following types of attacks does this describe?",
    "options": [
      "Vishing",
      "Smishing",
      "Pretexting",
      "Phishing"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 48,
    "text": "F2F48 \nWhich of the following risk management strategies should an enterprise adopt first if a \nlegacy application is critical to business operations and there are preventative controls \nthat are not yet implemented?",
    "options": [
      "Mitigate",
      "Accept",
      "Transfer",
      "Avoid"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 49,
    "text": "F2F49 \nVisitors to a secured facility are required to check in with a photo ID and enter the facility \nthrough an access control vestibule. \nWhich of the following best describes this form of security control?",
    "options": [
      "Physical",
      "Managerial",
      "Technical",
      "Operational"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 50,
    "text": "F2F50 \nThe local administrator account for a company's VPN appliance was unexpectedly used \nto \nlog in to the remote management interface. Which of the following would have most \nlikely \nprevented this from happening?",
    "options": [
      "Using least privilege",
      "Changing the default password",
      "Assigning individual user IDs",
      "Reviewing logs more frequently"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 51,
    "text": "F2F51 \nWhich of the following is the best way to secure an on-site data center against intrusion \nfrom an insider?",
    "options": [
      "Bollards",
      "Access badge",
      "Motion sensor",
      "Video surveillance"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 52,
    "text": "F2F52 \nAn engineer moved to another team and is unable to access the new team's shared \nfolders while still being able to access the shared folders from the former team. After \nopening a ticket, the engineer discovers that the account was never moved to the new \ngroup. Which of the following access controls is most likely causing the lack of access?",
    "options": [
      "Role-based",
      "Discretionary",
      "Time of day",
      "Least privilege"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 53,
    "text": "F2F53 \nWhich of the following factors are the most important to address when formulating a \ntraining curriculum plan for a security awareness program? (Choose two.)",
    "options": [
      "Channels by which the organization communicates with customers",
      "The reporting mechanisms for ethics violations",
      "Threat vectors based on the industry in which the organization operates",
      "Secure software development training for all personnel",
      "Cadence and duration of training events",
      "Retraining requirements for individuals who fail phishing simulations"
    ],
    "correct": [
      2,
      4
    ],
    "multi": true
  },
  {
    "id": 54,
    "text": "F2F54 \nA network administrator is working on a project to deploy a load balancer in the \ncompany's \ncloud environment. Which of the following fundamental security requirements does this \nproject fulfil?",
    "options": [
      "Privacy",
      "Integrity",
      "Confidentiality",
      "Availability"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 55,
    "text": "F2F55 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\f56 \nF2F56 \nWhich of the following would be most useful in determining whether the long-term cost \nto \ntransfer a risk is less than the impact of the risk?",
    "options": [
      "ARO",
      "RTO",
      "RPO",
      "ALE",
      "SLE"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 56,
    "text": "F2F57 \nIn order to strengthen a password and prevent a hacker from cracking it, a random string \nof 36 characters was added to the password. Which of the following best describes this \ntechnique?",
    "options": [
      "Key stretching",
      "Tokenization",
      "Data masking",
      "Salting"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 57,
    "text": "F2F58 \nA technician is deploying a new security camer",
    "options": [
      "Which of the following should the technician do?",
      "Perform a vulnerability scan.",
      "Disable unnecessary ports.",
      "Conduct a site survey."
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 58,
    "text": "F2F59 \nA company is experiencing a web services outage on the publicnetwork. The services \nare \nup and available but inaccessible. \nThe network logs show a sudden increase in network traffic that is causing the outage. \nWhich of the following attacks is the organization experiencing?",
    "options": [
      "ARP poisoning",
      "Brute force",
      "Buffer overflow",
      "DDoS"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 59,
    "text": "F2F60 \nWhich of the following threat actors is the most likely to be motivated by profit?",
    "options": [
      "Hacktivist",
      "Insider threat",
      "Organized crime",
      "Shadow IT"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 60,
    "text": "F2F61 \nAn organization experiences a cybersecurity incident involving a command-and-control \nserver. Which of the following logs should be analyzed to identify the impacted host? \n(Choose two.)",
    "options": [
      "Application",
      "Authentication",
      "DHCP",
      "Network",
      "Firewall",
      "Database"
    ],
    "correct": [
      3,
      4
    ],
    "multi": true
  },
  {
    "id": 61,
    "text": "F2F62 \nDuring a penetration test, a vendor attempts to enter an unauthorized area using an \naccess badge. Which of the following types of tests does this represent?",
    "options": [
      "Defensive",
      "Passive",
      "Offensive",
      "Physical"
    ],
    "correct": [
      3,
      4
    ],
    "multi": true
  },
  {
    "id": 62,
    "text": "F2F63 \nA systems administrator uses a key to encrypt a message being sent to a peer in a \ndifferent branch office. The peer then uses the same key to decrypt the message. Which \nof the following describes this example?",
    "options": [
      "Symmetric",
      "Asymmetric",
      "Hashing",
      "Salting"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 63,
    "text": "F2F64 \nA visitor plugs a laptop into a network jack in the lobby and is able to connect to the \ncompany's network. Which of the following should be configured on the existing network \ninfrastructure to best prevent this activity?",
    "options": [
      "Port security",
      "Web application firewall",
      "Transport layer security",
      "Virtual private network"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 64,
    "text": "F2F65 \nA security administrator is reissuing a former employee's laptop. Which of the following \nis \nthe best combination of data handling activities for the administrator to perform? \n(Choose \ntwo.)",
    "options": [
      "Data retention",
      "Certification",
      "Destruction",
      "Classification",
      "Sanitization",
      "Enumeration"
    ],
    "correct": [
      1,
      4
    ],
    "multi": true
  },
  {
    "id": 65,
    "text": "F2F66 \nA systems administrator would like to deploy a change to a production system. Which of \nthe following must the administrator submit to demonstrate that the system can be \nrestored to a working state in the event of a performance issue?",
    "options": [
      "Backout plan",
      "Impact analysis",
      "Test procedure",
      "Approval procedure"
    ],
    "correct": [
      1,
      4
    ],
    "multi": true
  },
  {
    "id": 66,
    "text": "F2F67 \nA company is redesigning its infrastructure and wants to reduce the number of physical \nservers in use. Which of the following architectures is best suited for this goal?",
    "options": [
      "Serverless",
      "Segmentation",
      "Virtualization",
      "Microservices"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 67,
    "text": "F2F68 \nA bank set up a new server that contains customers' PII. Which of the following should \nthe \nbank use to make sure the sensitive data is not modified?",
    "options": [
      "Full disk encryption",
      "Network access control",
      "File integrity monitoring",
      "User behavior analytics"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 68,
    "text": "F2F69 \nUsers at a company are reporting they are unable to access the URL for a new retail \nwebsite because it is flagged as gambling and is being blocked. Which of the following \nchanges would allow users to access the site?",
    "options": [
      "Creating a firewall rule to allow HTTPS traffic",
      "Configuring the IPS to allow shopping",
      "Tuning the DLP rule that detects credit card data",
      "Updating the categorization in the content filter"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 69,
    "text": "F2F70 \nWhich of the following most impacts an administrator's ability to address CVEs \ndiscovered \non a server?",
    "options": [
      "Rescanning requirements",
      "Patch availability",
      "Organizational impact",
      "Risk tolerance"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 70,
    "text": "F2F71 \nWhich of the following describes effective change management procedures?",
    "options": [
      "Approving the change after a successful deployment",
      "Having a backout plan when a patch fails",
      "Using a spreadsheet for tracking changes",
      "Using an automatic change control bypass for security updates"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 71,
    "text": "F2F72 \nThe CIRT is reviewing an incident that involved a human resources recruiter exfiltrating \nsensitive company data. The CIRT found that the recruiter was able to use HTTP over \nport",
    "options": [
      "WAF utilizing SSL decryption",
      "NGFW utilizing application inspection",
      "UTM utilizing a threat feed",
      "SD-WAN utilizing IPSec"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 72,
    "text": "F2F73 \nAn enterprise is working with a third party and needs to allow access between the \ninternal \nnetworks of both parties for a secure file migration. The solution needs to ensure \nencryption is applied to all traffic that is traversing the networks. Which of the following \nsolutions should most likely be implemented?",
    "options": [
      "EAP",
      "IPSec",
      "SD-WAN",
      "TLS"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 73,
    "text": "F2F74 \nAn administrator has identified and fingerprinted specific files that will generate an alert \nif \nan attempt is made to email these files outside of the organization. Which of the \nfollowing \nbest describes the tool the administrator is using?",
    "options": [
      "DLP",
      "SNMP traps",
      "SCAP",
      "IPS"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 74,
    "text": "F2F75 \nA software developer released a new application and is distributing application files via \nthe \ndeveloper's website. Which of the following should the developer post on the website to \nallow users to verify the integrity of the downloaded files?",
    "options": [
      "Hashes",
      "Certificates",
      "Algorithms",
      "Salting"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 75,
    "text": "F2F76 \nAn organization wants to limit potential impact to its log-in database in the event of a \nbreach. Which of the following options is the security team most likely to recommend?",
    "options": [
      "Tokenization",
      "Hashing",
      "Obfuscation",
      "Segmentation"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 76,
    "text": "F2F77 \nAn administrator finds that all user workstations and servers are displaying a message \nthat is associated with files containing an extension of .ryk. Which of the following types \nof \ninfections is present on the systems?",
    "options": [
      "Virus",
      "Trojan",
      "Spyware",
      "Ransomware"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 77,
    "text": "F2F78",
    "options": [
      "Recovery point objective",
      "Mean time between failures",
      "Recovery time objective",
      "Mean time to repair"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 78,
    "text": "F2F80 \nA security engineer is installing an IPS to block signature-based attacks in the \nenvironment. \nWhich of the following modes will best accomplish this task?",
    "options": [
      "Monitor",
      "Sensor",
      "Audit",
      "Active"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 79,
    "text": "F2F81 \nAn IT manager is increasing the security capabilities of an organization after a data \nclassification initiative determined that sensitive data could be exfiltrated from the \nenvironment. Which of the following solutions would mitigate the risk?",
    "options": [
      "XDR",
      "SPF",
      "DLP",
      "DMARC"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 80,
    "text": "F2F82 \nWhich of the following is used to protect a computer from viruses, malware, and Trojans \nbeing installed and moving laterally across the network?",
    "options": [
      "IDS",
      "ACL",
      "EDR",
      "NAC"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 81,
    "text": "F2F83 \nClient files can only be accessed by employees who need to know the information and \nhave specified roles in the company. \nWhich of the following best describes this security concept?",
    "options": [
      "Availability",
      "Confidentiality",
      "Integrity",
      "Non-repudiation"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 82,
    "text": "F2F84 \nWhich of the following describes the category of data that is most impacted when it is \nlost?",
    "options": [
      "Confidential",
      "Public",
      "Private",
      "Critical"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 83,
    "text": "F2F85 \nA new employee logs in to the email system for the first time and notices a message \nfrom \nhuman resources about onboarding. \nThe employee hovers over a few of the links within the email and discovers that the links \ndo not correspond to links associated with the company. Which of the following attack \nvectors is most likely being used?",
    "options": [
      "Business email",
      "Social engineering",
      "Unsecured network",
      "Default credentials"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 84,
    "text": "F2F86 \nWhich of the following describes the understanding between a company and a client \nabout what will be provided and the accepted time needed to provide the company with \nthe resources?",
    "options": [
      "SLA",
      "MOU",
      "MOA",
      "BPA"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 85,
    "text": "F2F87 \nA company that is located in an area prone to hurricanes is developing a disaster \nrecovery \nplan and looking at site considerations that allow the company to immediately continue \noperations. Which of the following is the best type of site for this company?",
    "options": [
      "Cold",
      "Tertiary",
      "Warm",
      "Hot"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 86,
    "text": "F2F88 \nWhich of the following security controls is most likely being used when a critical legacy \nserver is segmented into a private network?",
    "options": [
      "Deterrent",
      "Corrective",
      "Compensating",
      "Preventive"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 87,
    "text": "F2F87 \nWhich of the following best describes the practice of researching laws and regulations \nrelated to information security operations within a specific industry?",
    "options": [
      "Compliance reporting",
      "GDPR",
      "Due diligence",
      "Attestation"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 88,
    "text": "F2F90 \nWhich of the following considerations is the most important for an organization to \nevaluate \nas it establishes and maintains a data privacy program?",
    "options": [
      "Reporting structure for the data privacy officer",
      "Request process for data subject access",
      "Role as controller or processor",
      "Physical location of the company"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 89,
    "text": "F2F91 \nA security analyst is investigating a workstation that is suspected of outbound \ncommunication to a command-and-control server. During the investigation, the analyst \ndiscovered that logs on the endpoint were deleted. Which of the following logs would the \nanalyst most likely look at next?",
    "options": [
      "IPS",
      "Firewall",
      "ACL",
      "Windows security"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 90,
    "text": "F2F92 \nAn IT manager is putting together a documented plan describing how the organization \nwill \nkeep operating in the event of a global incident. Which of the following plans is the IT \nmanager creating?",
    "options": [
      "Business continuity",
      "Physical security",
      "Change management",
      "Disaster recovery"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 91,
    "text": "F2F93 \nA business needs a recovery site but does not require immediate failover. The business \nalso wants to reduce the workload required to recover from an outage. Which of the \nfollowing recovery sites is the best option?",
    "options": [
      "Hot",
      "Cold",
      "Warm",
      "Geographically dispersed"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 92,
    "text": "F2F94 \nA security team is setting up a new environment for hosting the organization's \non-premises software application as a cloud based service. Which of the following \nshould the team ensure is in place in order for the organization to follow security best \npractices?",
    "options": [
      "Virtualization and isolation of resources",
      "Network segmentation",
      "Data encryption",
      "Strong authentication policies"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 93,
    "text": "F2F95 \nA manager receives an email that contains a link to receive a refund. After hovering over \nthe link, the manager notices that the domain's URL points to a suspicious link. Which of \nthe following security practices helped the manager to identify the attack?",
    "options": [
      "End user training",
      "Policy review",
      "URL scanning",
      "Plain text email"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 94,
    "text": "F2F96 \nA company wants to verify that the software the company is deploying came from the \nvendor the company purchased the software from. Which of the following is the best \nway \nfor the company to confirm this information?",
    "options": [
      "Validate the code signature.",
      "Execute the code in a sandbox.",
      "Search the executable for ASCII strings.",
      "Generate a hash of the files."
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 95,
    "text": "F2F97 \nA systems administrator notices that one of the systems critical for processing \ncustomer \ntransactions is running an end-of-life operating system. Which of the following \ntechniques \nwould increase enterprise security?",
    "options": [
      "Installing HIDS on the system",
      "Placing the system in an isolated VLAN",
      "Decommissioning the system",
      "Encrypting the system's hard drive"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 96,
    "text": "F2F98 \nThe Chief Information Security Officer (CISO) at a large company would like to gain an \nunderstanding of how the company's security policies compare to the requirements \nimposed by external regulators. Which of the following should the CISO use?",
    "options": [
      "Penetration test",
      "Internal audit",
      "Attestation",
      "External examination"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 97,
    "text": "F2F99 \nA systems administrator notices that the research and development department is not \nusing the company VPN when accessing various company-related services and \nsystems. \nWhich of the following scenarios describes this activity?",
    "options": [
      "Espionage",
      "Data exfiltration",
      "Nation-state attack",
      "Shadow IT"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 98,
    "text": "F2F100 \nThe marketing department set up its own project management software without telling \nthe \nappropriate departments. Which of the following describes this scenario?",
    "options": [
      "Shadow IT",
      "Insider threat",
      "Data exfiltration",
      "Service disruption"
    ],
    "correct": [
      0
    ],
    "multi": false
  }
]