[
  {
    "id": 1,
    "text": "F3F1 \nWhich of the following would best explain why a security analyst is running daily \nvulnerability scans on all corporate endpoints?",
    "options": [
      "To track the status of patching installations",
      "To find shadow IT cloud deployments",
      "To continuously the monitor hardware inventory",
      "To hunt for active attackers in the network"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 2,
    "text": "F3F2 \nWhich of the following is classified as high availability in a cloud environment?",
    "options": [
      "Access broker",
      "Cloud HSM",
      "WAF",
      "Load balancer"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 3,
    "text": "F3F3 \nWhich of the following security measures is required when using a cloud-based platform \nfor loT management?",
    "options": [
      "Encrypted connection",
      "Federated identity",
      "Firewall",
      "Single sign-on"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 4,
    "text": "F3F4 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\fWhich of the following threat vectors is most commonly utilized by insider threat actors \nattempting data exfiltration?",
    "options": [
      "Unidentified removable devices",
      "Default network device credentials",
      "Spear phishing emails",
      "Impersonation of business units through typosquatting"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 5,
    "text": "F3F5 \nWhich of the following methods to secure credit card data is best to use when a \nrequirement is to see only the last four numbers on a credit card?",
    "options": [
      "Encryption",
      "Hashing",
      "Masking",
      "Tokenization"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 6,
    "text": "F3F6 \nThe Chief Information Security Officer (CISO) has determined the company is \nnon-compliant with local data privacy regulations. \nThe CISO needs to justify the budget request for more resources. Which of the following \nshould the CISO present to the board as the direct consequence of non-compliance?",
    "options": [
      "Fines",
      "Reputational damage",
      "Sanctions",
      "Contractual implications"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 7,
    "text": "F3F7 \nWhich of the following alert types is the most likely to be ignored over time?",
    "options": [
      "True positive",
      "True negative",
      "False positive",
      "False negative"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 8,
    "text": "F3F8 \nA security analyst is investigating an application server and discovers that software on \nthe \nserver is behaving abnormally. The software normally runs batch jobs locally and does \nnot \ngenerate traffic, but the process is now generating outbound traffic over random high \nports. \nWhich of the following vulnerabilities has likely been exploited in this software?",
    "options": [
      "Memory injection",
      "Race condition",
      "Side loading",
      "SQL injection"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 9,
    "text": "F3F9 \nAn important patch for a critical application has just been released, and a systems \nadministrator is identifying all of the systems requiring the patch. Which of the following \nmust be maintained in order to ensure that all systems requiring the patch are updated?",
    "options": [
      "Asset inventory",
      "Network enumeration",
      "Data certification",
      "Procurement process"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 10,
    "text": "F3F10 \nWhich of the following should a security operations center use to improve its incident \nresponse procedure?",
    "options": [
      "Playbooks",
      "Frameworks",
      "Baselines",
      "Benchmarks"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 11,
    "text": "F3F11 \nWhich of the following describes an executive team that is meeting in a board room and \ntesting the company's incident response plan?",
    "options": [
      "Continuity of operations",
      "Capacity planning",
      "Tabletop exercise",
      "Parallel processing"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 12,
    "text": "F3F12 \nA healthcare organization wants to provide a web application that allows individuals to \ndigitally report health emergencies. \nWhich of the following is the most important consideration during development?",
    "options": [
      "Scalability",
      "Availability",
      "Cost",
      "Ease of deployment"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 13,
    "text": "F3F13 \nWhich of the following agreement types defines the time frame in which a vendor needs \nto \nrespond?",
    "options": [
      "SOW",
      "SLA",
      "MOA",
      "MOU"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 14,
    "text": "F3F14 \nWhich of the following is a feature of a next-generation SIEM system?",
    "options": [
      "Virus signatures",
      "Automated response actions",
      "Security agent deployment",
      "Vulnerability scanning"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 15,
    "text": "F3F15 \nTo improve the security at a data center, a security administrator implements a CCTV \nsystem and posts several signs about the possibility of being filmed. Which of the \nfollowing best describe these types of controls? (Choose two.)",
    "options": [
      "Preventive",
      "Deterrent",
      "Corrective",
      "Directive",
      "Compensating",
      "Detective"
    ],
    "correct": [
      1,
      5
    ],
    "multi": true
  },
  {
    "id": 16,
    "text": "F3F16 \nWhich of the following examples would be best mitigated by input sanitization?",
    "options": [
      "<script>alert(\"Warning\") ;< /script>",
      "nmap - 10.11.1.130",
      "Email message: \"Click this link to get your free gift card.\"",
      "Browser message: \"Your connection is not private.\""
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 17,
    "text": "F3F17 \nAn attacker posing as the Chief Executive Officer calls an employee and instructs the \nemployee to buy gift cards. Which of the following techniques is the attacker using?",
    "options": [
      "Smishing",
      "Disinformation",
      "Impersonating",
      "Whaling"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 18,
    "text": "F3F18 \nAfter conducting a vulnerability scan, a systems administrator notices that one of the \nidentified vulnerabilities is not present on the systems that were scanned. Which of the \nfollowing describes this example?",
    "options": [
      "False positive",
      "False negative",
      "True positive",
      "True negative"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 19,
    "text": "F3F19 \nA recent penetration test identified that an attacker could flood the MAC address table \nof \nnetwork switches. Which of the following would best mitigate this type of attack?",
    "options": [
      "Load balancer",
      "Port security",
      "IPS",
      "NGFW"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 20,
    "text": "F3F20 \nA user would like to install software and features that are not available with a \nsmartphone's default software. Which of the following would allow the user to install \nunauthorized software and enable new features?",
    "options": [
      "SQLi",
      "Cross-site scripting",
      "Jailbreaking",
      "Side loading"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 21,
    "text": "F3F21 \nWhich of the following phases of an incident response involves generating reports?",
    "options": [
      "Recovery",
      "Preparation",
      "Lessons learned",
      "Containment"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 22,
    "text": "F3F22 \nWhich of the following methods would most likely be used to identify legacy systems?",
    "options": [
      "Bug bounty program",
      "Vulnerability scan",
      "Package monitoring",
      "Dynamicanalysis"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 23,
    "text": "F3F23 \nEmployees located off-site must have access to company resources in order to \ncomplete \ntheir assigned tasks. These employees utilize a solution that allows remote access \nwithout interception concerns. Which of the following best describes this solution?",
    "options": [
      "Proxy server",
      "NGFW",
      "VPN",
      "Security zone"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 24,
    "text": "F3F24 \nA company allows customers to upload PDF documents to its public e-commerce \nwebsite. \nWhich of the following would a security analyst most likely recommend?",
    "options": [
      "Utilizing attack signatures in an IDS",
      "Enabling malware detection through a UTM",
      "Limiting the affected servers with a load balancer",
      "Blocking command injections via a WAF"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 25,
    "text": "F3F25 \nA security analyst developed a script to automate a trivial and repeatable task. Which of \nthe following best describes the benefits of ensuring other team members understand \nhow \nthe script works?",
    "options": [
      "To reduce implementation cost",
      "To identify complexity",
      "To remediate technical debt",
      "To prevent a single point of failure"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 26,
    "text": "F3F26 \nA company is decommissioning its physical servers and replacing them with an \narchitecture that will reduce the number of individual operating systems. Which of the \nfollowing strategies should the company use to achieve this security requirement?",
    "options": [
      "Microservices",
      "Containerization",
      "Virtualization",
      "Infrastructure as code"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 27,
    "text": "F3F27 \nAn administrator needs to perform server hardening before deployment. Which of the \nfollowing steps should the administrator take? (Choose two.)",
    "options": [
      "Disable default accounts.",
      "Add the server to the asset inventory.",
      "Remove unnecessary services.",
      "Document default passwords.",
      "Send server logs to the SIEM.",
      "Join the server to the corporate domain."
    ],
    "correct": [
      0,
      2
    ],
    "multi": true
  },
  {
    "id": 28,
    "text": "F3F28 \nA Chief Information Security Officer would like to conduct frequent, detailed reviews of \nsystems and procedures to track compliance objectives. Which of the following will be \nthe \nbest method to achieve this objective?",
    "options": [
      "Third-party attestation",
      "Penetration testing",
      "Internal auditing",
      "Vulnerability scans"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 29,
    "text": "F3F29 \nWhich of the following security concepts is accomplished with the installation of a \nRADIUS server?",
    "options": [
      "CIA",
      "AAA",
      "ACL",
      "PEM"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 30,
    "text": "F3F30 \nAfter creating a contract for IT contractors, the human resources department changed \nseveral clauses. The contract has gone through three revisions. Which of the following \nprocesses should the human resources department follow to track revisions?",
    "options": [
      "Version validation",
      "Version changes",
      "Version updates",
      "Version control"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 31,
    "text": "F3F31 \nThe executive management team is mandating the company develop a disaster recovery \nplan. The cost must be kept to a minimum, and the money to fund additional internet \nconnections is not available. Which of the following would be the best option?",
    "options": [
      "Hot site",
      "Cold site",
      "Failover site",
      "Warm site"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 32,
    "text": "F3F32 \nAn administrator at a small business notices an increase in support calls from \nemployees \nwho receive a blocked page message after trying to navigate to a spoofed website. \nWhich \nof the following should the administrator do?",
    "options": [
      "Deploy multifactor authentication.",
      "Decrease the level of the web filter settings.",
      "Implement security awareness training.",
      "Update the acceptable use policy."
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 33,
    "text": "F3F33 \nWhich of the following teams is best suited to determine whether a company has \nsystems \nthat can be exploited by a potential, identified vulnerability?",
    "options": [
      "Purple team",
      "Blue team",
      "Red team",
      "White team"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 34,
    "text": "F3F34 \nA company is reviewing options to enforce user logins after several account takeovers. \nThe following conditions must be met as part of the solution: \n-Allow employees to work remotely or from assigned offices around the world. \n-Provide a seamless login experience. \n-Limit the amount of equipment required. \nWhich of the following best meets these conditions?",
    "options": [
      "Trusted devices",
      "Geotagging",
      "Smart cards",
      "Time-based logins"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 35,
    "text": "F3F35 \nWhich of the following methods can be used to detect attackers who have successfully \ninfiltrated a network? (Choose two.)",
    "options": [
      "Tokenization",
      "CI/CD",
      "Honeypots",
      "Threat modeling",
      "DNS sinkhole",
      "Data obfuscation"
    ],
    "correct": [
      2,
      4
    ],
    "multi": true
  },
  {
    "id": 36,
    "text": "F3F36 \nA company wants to ensure that the software it develops will not be tampered with after \nthe final version is completed. Which of the following should the company most likely \nuse?",
    "options": [
      "Hashing",
      "Encryption",
      "Baselines",
      "Tokenization",
      "G. Deterrent"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 37,
    "text": "F3F37 \nAn organization completed a project to deploy SSO across all business applications last \nyear. Recently, the finance department selected a new cloud-based accounting \nsoftware \nvendor. Which of the following should most likely be configured during the new software \ndeployment?",
    "options": [
      "RADIUS",
      "SAML",
      "EAP",
      "OpenID",
      "G. Deterrent"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 38,
    "text": "F3F38 \nA user, who is waiting for a flight at an airport, logs in to the airline website using the \npublic \nWi-Fi, ignores a security warning and purchases an upgraded seat. When the flight \nlands, \nthe user finds unauthorized credit card charges. Which of the following attacks most \nlikely \noccurred?",
    "options": [
      "Replay attack",
      "Memory leak",
      "Buffer overflow attack",
      "On-path attack",
      "G. Deterrent"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 39,
    "text": "F3F39 \nA network engineer deployed a redundant switch stack to increase system availability. \nHowever, the budget can only cover the cost of one ISP connection. Which of the \nfollowing best describes the potential risk factor?",
    "options": [
      "The equipment MTBF is unknown.",
      "The ISP has no SLA.",
      "An RPO has not been determined.",
      "There is a single point of failure.",
      "G. Deterrent"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 40,
    "text": "F3F40 \nA network team segmented a critical, end-of-life server to a VLAN that can only be \nreached by specific devices but cannot be reached by the perimeter network. Which of \nthe \nfollowing best describe the controls the team implemented? (Choose two.)",
    "options": [
      "Managerial",
      "Physical",
      "Corrective",
      "Detective",
      "Compensating",
      "G. Deterrent"
    ],
    "correct": [
      4,
      5
    ],
    "multi": true
  },
  {
    "id": 41,
    "text": "F3F41 \nA threat actor was able to use a username and password to log in to a stolen company \nmobile device. Which of the following provides the best solution to increase mobile data \nsecurity on all employees' company mobile devices?",
    "options": [
      "Application management",
      "Full disk encryption",
      "Remote wipe",
      "Containerization"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 42,
    "text": "F3F42 \nWhich of the following best describes the risk present after controls and mitigating \nfactors \nhave been applied?",
    "options": [
      "Residual",
      "Avoided",
      "Inherent",
      "Operational"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 43,
    "text": "F3F43 \nA software development team asked a security administrator to recommend techniques \nthat should be used to reduce the chances of the software being reverse engineered. \nWhich of the following should the security administrator recommend?",
    "options": [
      "Digitally signing the software",
      "Performing code obfuscation",
      "Limiting the use of third-party libraries",
      "Using compile flags"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 44,
    "text": "F3F44 \nWhich of the following is a possible factor for MFA?",
    "options": [
      "Something you exhibit",
      "Something you have",
      "Somewhere you are",
      "Someone you know"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 45,
    "text": "F3F45 \nEasy-to-guess passwords led to an account compromise. The current password policy \nrequires at least 12 alphanumeric characters, one uppercase character, one lowercase \ncharacter, a password history of two passwords, a minimum password age of one day, \nand a maximum password age of 90 days. Which of the following would reduce the risk \nof \nthis incident from happening again? (Choose two.)",
    "options": [
      "Increasing the minimum password length to 14 characters.",
      "Upgrading the password hashing algorithm from MD5 to SHA-512.",
      "Increasing the maximum password age to 120 days.",
      "Reducing the minimum password length to ten characters.",
      "Reducing the minimum password age to zero days.",
      "Including a requirement for at least one special character."
    ],
    "correct": [
      0,
      5
    ],
    "multi": true
  },
  {
    "id": 46,
    "text": "F3F46 \nA user downloaded software from an online forum. After the user installed the software, \nthe security team observed external network traffic connecting to the user's computer \non \nan uncommon port. Which of the following is the most likely explanation of this \nunauthorized connection?",
    "options": [
      "The software had a hidden keylogger.",
      "The software was ransomware.",
      "The user's computer had a fileless virus.",
      "The software contained a backdoor."
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 47,
    "text": "F3F47 \nA utility company is designing a new platform that will host all the virtual machines used \nby \nbusiness applications. The requirements include: \n-A starting baseline of 50% memory utilization \n-Storage scalability \n-Single circuit failure resilience \nWhich of the following best meets all of these requirements?",
    "options": [
      "Connecting dual PDUs to redundant power supplies",
      "Transitioning the platform to an laaS provider",
      "Configuring network load balancing for multiple paths",
      "Deploying multiple large NAS devices for each host"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 48,
    "text": "F3F48 \nWhich of the following best describes a use case for a DNS sinkhole?",
    "options": [
      "company's domain structure.",
      "malicious ones owned by the attacker.",
      "attackers.",
      "network resources."
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 49,
    "text": "F3F49 \nAn incident analyst finds several image files on a hard disk. The image files may contain \ngeolocation coordinates. Which of the following best describes the type of information \nthe analyst is trying to extract from the image files?",
    "options": [
      "Log data",
      "Metadata",
      "Encrypted data",
      "Sensitive data"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 50,
    "text": "F3F50 \nWhich of the following most likely describes why a security engineer would configure all \noutbound emails to use S/MIME digital signatures?",
    "options": [
      "To meet compliance standards",
      "To increase delivery rates",
      "To block phishing attacks",
      "To ensure non-repudiation"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 51,
    "text": "F3F51 \nDuring a recent company safety stand-down, the cyber-awareness team gave a \npresentation on the importance of cyber hygiene. One topic the team covered was best \npractices for printing centers. Which of the following describes an attack method that \nrelates to printing centers?",
    "options": [
      "Whaling",
      "Credential harvesting",
      "Prepending",
      "Dumpster diving"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 52,
    "text": "F3F52 \nWhich of the following considerations is the most important regarding cryptography \nused \nin an loT device?",
    "options": [
      "Resource constraints",
      "Available bandwidth",
      "The use of block ciphers",
      "The compatibility of the TLS version"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 53,
    "text": "F3F53 \nA coffee shop owner wants to restrict internet access to only paying customers by \nprompting them for a receipt number. Which of the following is the best method to use \ngiven this requirement?",
    "options": [
      "WPA3",
      "Captive portal",
      "PSK",
      "IEEE 802.1X"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 54,
    "text": "F3F54 \nWhile performing digital forensics, which of the following is considered the most volatile \nand should have the contents collected first?",
    "options": [
      "Hard drive",
      "RAM",
      "SSD",
      "Temporary files"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 55,
    "text": "F3F55 \nA hosting provider needs to prove that its security controls have been in place over the \nlast six months and have sufficiently protected customer data. Which of the following \nwould provide the best proof that the hosting provider has met the requirements?",
    "options": [
      "NIST CSF",
      "SOC 2 Type 2 report",
      "CIS Top 20 compliance reports",
      "Vulnerability report"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 56,
    "text": "F3F56 \nA city municipality lost its primary data center when a tornado hit the facility. Which of \nthe \nfollowing should the city staff use immediately after the disaster to handle essential \npublic \nservices?",
    "options": [
      "BCP",
      "Communication plan",
      "DRP",
      "IRP"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 57,
    "text": "F3F57 \nWhich of the following is considered a preventive control?",
    "options": [
      "Configuration auditing",
      "Log correlation",
      "Incident alerts",
      "Segregation of duties"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 58,
    "text": "F3F58 \nA systems administrator notices that a testing system is down. While investigating, the \nsystems administrator finds that the servers are online and accessible from any device \non the server network. The administrator reviews the following information from the \nmonitoring system: \nWhich of the following is the most likely cause of the outage?",
    "options": [
      "Denial of service",
      "ARP poisoning",
      "Jamming",
      "Kerberoasting"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 59,
    "text": "F3F59 \nA security team has been alerted to a flood of incoming emails that have various subject \nlines and are addressed to multiple email inboxes. Each email contains a URL shortener \nlink that is redirecting to a dead domain. Which of the following is the best step for the \nsecurity team to take?",
    "options": [
      "Create a blocklist for all subject lines.",
      "Send the dead domain to a DNS sinkhole.",
      "Quarantine all emails received and notify all employees.",
      "Block the URL shortener domain in the web proxy."
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 60,
    "text": "F3F60 \nA security administrator is working to secure company data on corporate laptops in case \nthe laptops are stolen. Which of the following solutions should the administrator \nconsider?",
    "options": [
      "Disk encryption",
      "Data loss prevention",
      "Operating system hardening",
      "Boot security"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 61,
    "text": "F3F61 \nA company needs to keep the fewest records possible, meet compliance needs, and \nensure destruction of records that are no longer needed. Which of the following best \ndescribes the policy that meets these requirements?",
    "options": [
      "Security policy",
      "Classification policy",
      "Retention policy",
      "Access control policy"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 62,
    "text": "F3F62 \nWhich of the following is a common source of unintentional corporate credential \nleakage \nin cloud environments?",
    "options": [
      "Code repositories",
      "Dark web",
      "Threat feeds",
      "State actors",
      "Vulnerability databases"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 63,
    "text": "F3F63 \nWhich of the following is the best reason an organization should enforce a data \nclassification policy to help protect its most sensitive information?",
    "options": [
      "documents.",
      "The policy will result in the creation of access levels for each level of classification.",
      "classification levels.",
      "before opening it."
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 64,
    "text": "F3F64 \nAn analyst is performing a vulnerability scan against the web servers exposed to the \ninternet without a system account. Which of the following is most likely being \nperformed?",
    "options": [
      "Non-credentialed scan",
      "Packet capture",
      "Privilege escalation",
      "System enumeration",
      "Passive scan"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 65,
    "text": "F3F65 \nA security administrator is hardening corporate systems and applying appropriate \nmitigations by consulting a real-world knowledge base for adversary behavior. Which of \nthe following would be best for the administrator to reference?",
    "options": [
      "MITRE ATT&CK",
      "CSIRT",
      "CVSS",
      "SOAR"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 66,
    "text": "F3F66 \nAn architect has a request to increase the speed of data transfer using JSON requests \nexternally. Currently, the organization uses SFTP to transfer data files. Which of the \nfollowing will most likely meet the requirements?",
    "options": [
      "A website-hosted solution",
      "Cloud shared storage",
      "A secure email solution",
      "Microservices using API"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 67,
    "text": "F3F67 \nWhich of the following addresses individual rights such as the right to be informed, the \nright of access, and the right to be forgotten?",
    "options": [
      "GDPR",
      "PCI DSS",
      "NIST",
      "ISO"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 68,
    "text": "F3F68 \nAn administrator is installing an LDAP browser tool in order to view objects in the \ncorporate LDAP directory. Secure connections to the LDAP server are required. When \nthe \nbrowser connects to the server, certificate errors are being displayed, and then the \nconnection is terminated. Which of the following is the most likely solution?",
    "options": [
      "The administrator should allow SAN certificates in the browser configuration.",
      "The administrator needs to install the server certificate into the local truststore.",
      "The administrator should request that the secure LDAP port be opened to the server.",
      "The administrator needs to increase the TLS version on the organization's RA."
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 69,
    "text": "F3F69 \nWhich of the following is the most important security concern when using legacy \nsystems \nto provide production service?",
    "options": [
      "Instability",
      "Lack of vendor support",
      "Loss of availability",
      "Use of insecure protocols"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 70,
    "text": "F3F70 \nA security investigation revealed that malicious software was installed on a server using \na \nserver administrator's credentials. \nDuring the investigation, the server administrator explained that Telnet was regularly \nused \nto log in. Which of the following most likely occurred?",
    "options": [
      "A spraying attack was used to determine which credentials to use.",
      "A packet capture tool was used to steal the password.",
      "A remote-access Trojan was used to install the malware.",
      "A dictionary attack was used to log in as the server administrator."
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 71,
    "text": "F3F71 \nA user is requesting Telnet access to manage a remote development web server. \nInsecure \nprotocols are not allowed for use within any environment. Which of the following should \nbe \nconfigured to allow remote access to this server?",
    "options": [
      "HTTPS",
      "SNMPv3",
      "SSH",
      "RDP",
      "SMTP"
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 72,
    "text": "F3F72 \nA security administrator is working to find a cost-effective solution to implement \ncertificates for a large number of domains and subdomains owned by the company. \nWhich of the following types of certificates should the administrator implement?",
    "options": [
      "Wildcard",
      "Client certificate",
      "Self-signed",
      "Code signing"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 73,
    "text": "F3F73 \nAn auditor discovered multiple insecure ports on some servers. Other servers were \nfound \nto have legacy protocols enabled. \nWhich of the following tools did the auditor use to discover these issues?",
    "options": [
      "Nessus",
      "curl",
      "Wireshark",
      "netcat"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 74,
    "text": "F3F74 \nA security analyst received a tip that sensitive proprietary information was leaked to the \npublic. The analyst is reviewing the PCAP and notices traffic between an internal server \nand an external host that includes the following: \n... \n12:47:22.327233 PPPoE [ses 0x8122] IP (tos 0x0, ttl 64, id 0, offset 0, flags [DF], proto \nIPv6 (41), length 331) 10.5.1.1 > \n52.165.16.154: IP6 (hlim E3, next-header TCP (6) paylcad length: 271) \n2001:67c:2158:a019 :: ace.53104 > \n2001:0:5ef5:79fd:380c:dddd:a601:24fa.13788: Flags [P.], cksum 0xd7ee (correct), seq \n97:348, ack 102, win 16444, length 251 \nWhich of the following was most likely used to exfiltrate the data?",
    "options": [
      "Encapsulation",
      "MAC address spoofing",
      "Steganography",
      "Broken encryption",
      "Sniffing via on-path position"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 75,
    "text": "F3F75 \nA company wants to reduce the time and expense associated with code deployment. \nWhich of the following technologies should the company utilize?",
    "options": [
      "Serverless architecture",
      "Thin clients",
      "Private cloud",
      "Virtual machines"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 76,
    "text": "F3F76 \nA security administrator is performing an audit on a stand-alone UNIX server, and the \nfollowing message is immediately displayed: \n(Error 13): /etc/shadow: Permission denied. \nWhich of the following best describes the type of tool that is being used?",
    "options": [
      "Pass-the-hash monitor",
      "File integrity monitor",
      "Forensicanalysis",
      "Password cracker"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 77,
    "text": "F3F77 \nA security administrator needs to create firewall rules for the following protocols: RTP, \nSIP, \nH.323. and SRTP. Which of the following does this rule set support?",
    "options": [
      "RTOS",
      "VolP",
      "SoC",
      "HVAC"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 78,
    "text": "F3F78 \nWhich of the following best describes a social engineering attack that uses a targeted \nelectronic messaging campaign aimed at a Chief Executive Officer?",
    "options": [
      "Whaling",
      "Spear phishing",
      "Impersonation",
      "Identity fraud"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 79,
    "text": "F3F79 \nDuring a penetration test, a flaw in the internal PKI was exploited to gain domain \nadministrator rights using specially crafted certificates. Which of the following \nremediation \ntasks should be completed as part of the cleanup phase?",
    "options": [
      "Updating the CRL",
      "Patching the CA",
      "Changing passwords",
      "Implementing SOAR"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 80,
    "text": "F3F80 \nA company wants to implement MF",
    "options": [
      "Which of the following enables the additional factor while using a smart card?",
      "Hardware token",
      "User ID",
      "SMS"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 81,
    "text": "F3F81 \nA company hired an external consultant to assist with required system upgrades to a \ncritical business application. A systems administrator needs to secure the consultant's \naccess without sharing passwords to critical systems. Which of the following solutions \nshould most likely be utilized?",
    "options": [
      "TACACS+",
      "SAML",
      "An SSO platform",
      "Role-based access control",
      "PAM software"
    ],
    "correct": [
      4
    ],
    "multi": false
  },
  {
    "id": 82,
    "text": "F3F82 \nA newly implemented wireless network is designed so that visitors can connect to the \nwireless network for business activities. \nThe legal department is concerned that visitors might connect to the network and \nperform \nillicit activities. Which of me following should the security team implement to address \nthis \nconcern?",
    "options": [
      "Configure a RADIUS server to manage device authentication.",
      "Use 802.1X on all devices connecting to wireless.",
      "Add a guest captive portal requiring visitors to accept terms and conditions.",
      "Allow for new devices to be connected via WPS."
    ],
    "correct": [
      2
    ],
    "multi": false
  },
  {
    "id": 83,
    "text": "F3F83 \nWhich of the following data roles is responsible for identifying risks and appropriate \naccess to data?",
    "options": [
      "Owner",
      "Custodian",
      "Steward",
      "Controller"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 84,
    "text": "F3F84 \nWhich of the following physical controls can be used to both detect and deter? (Choose \ntwo.)",
    "options": [
      "Lighting",
      "Fencing",
      "Signage",
      "Sensor",
      "Bollard",
      "Lock"
    ],
    "correct": [
      0,
      3
    ],
    "multi": true
  },
  {
    "id": 85,
    "text": "F3F85 \nA multinational bank hosts several servers in its data center. These servers run a \nbusiness-critical application used by customers to access their account information. \nWhich of the following should the bank use to ensure accessibility during peak usage \ntimes?",
    "options": [
      "Load balancer",
      "Cloud backups",
      "Geographic dispersal",
      "Disk multipathing"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 86,
    "text": "F3F86 \nThe author of a software package is concerned about bad actors repackaging and \ninserting malware into the software. The software download is hosted on a website, and \nthe author exclusively controls the website's contents. Which of the following \ntechniques \nwould best ensure the software's integrity?",
    "options": [
      "Input validation",
      "Code signing",
      "Secure cookies",
      "Fuzzing"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 87,
    "text": "F3F87 \nA third-party vendor is moving a particular application to the end-of-life stage at the end \nof \nthe current year. Which of the following is the most critical risk if the company chooses \nto \ncontinue running the application?",
    "options": [
      "Lack of security updates",
      "Lack of new features",
      "Lack of support",
      "Lack of source code access"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 88,
    "text": "F3F88 \nA security analyst recently read a report about a flaw in several of the organization's \nprinter models that causes credentials to be sent over the network in cleartext, \nregardless \nof the encryption settings. Which of the following would be best to use to validate this \nfinding?",
    "options": [
      "Wireshark",
      "netcat",
      "Nessus",
      "Nmap"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 89,
    "text": "F3F87 \nA development team is launching a new public-facing web product. The Chief \nInformation \nSecurity Officer has asked that the product be protected from attackers who use \nmalformed or invalid inputs to destabilize the system. Which of the following practices \nshould the development team implement?",
    "options": [
      "Fuzzing",
      "Continuous deployment",
      "Static code analysis",
      "Manual peer review"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 90,
    "text": "F3F90 \nDuring an annual review of the system design, an engineer identified a few issues with \nthe \ncurrently released design. Which of the following should be performed next according to \nbest practices?",
    "options": [
      "Risk management process",
      "Product design process",
      "Design review process",
      "Change control process"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 91,
    "text": "F3F91 \nWhich of the following is best to use when determining the severity of a vulnerability?",
    "options": [
      "CVE",
      "OSINT",
      "SOAR",
      "CVSS"
    ],
    "correct": [
      3
    ],
    "multi": false
  },
  {
    "id": 92,
    "text": "F3F92 \nAn organization experienced a security breach that allowed an attacker to send \nfraudulent \nwire transfers from a hardened PC exclusively to the attacker's bank through remote \nconnections. A security analyst is creating a timeline of events and has found a different \nPC on the network containing malware. Upon reviewing the command history, the \nanalyst \nfinds the following: \nPS>.\\mimikatz.exe \"sekurlsa :: pth /user:localadmin /domain:corp-domain.com \n/ntlm:B4B9B02E1F29A3CF193EAB28C8D617D3F327 \nWhich of the following best describes how the attacker gained access to the hardened \nPC?",
    "options": [
      "The attacker created fileless malware that was hosted by the banking platform.",
      "The attacker performed a pass-the-hash attack using a shared support account.",
      "response software.",
      "The attacker socially engineered the accountant into performing bad transfers."
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 93,
    "text": "F3F93 \nWhich of the following is the best resource to consult for information on the most \ncommon \napplication exploitation methods?",
    "options": [
      "OWASP",
      "STIX",
      "OVAL",
      "Threat intelligence feed",
      "Common Vulnerabilities and Exposures"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 94,
    "text": "F3F94 \n \n \n \n \n \n \n \n \n \n \n\f95 \nF3F95 \nA security analyst at an organization observed several user logins from outside the \norganization's network. The analyst determined that these logins were not performed by \nindividuals within the organization. Which of the following recommendations would \nreduce the likelihood of future attacks? (Choose two.)",
    "options": [
      "Disciplinary actions for users",
      "Conditional access policies",
      "More regular account audits",
      "Implementation of additional authentication factors",
      "Enforcement of content filtering policies",
      "A review of user account permissions"
    ],
    "correct": [
      1,
      3
    ],
    "multi": true
  },
  {
    "id": 95,
    "text": "F3F96 \nA security team is addressing a risk associated with the attack surface of the \norganization's web application over port 443. \nCurrently, no advanced network security capabilities are in place. Which of the following \nwould be best to set up? (Choose two.)",
    "options": [
      "NIDS",
      "Honeypot",
      "Certificate revocation list",
      "HIPS",
      "WAF",
      "SIEM"
    ],
    "correct": [
      0,
      4
    ],
    "multi": true
  },
  {
    "id": 96,
    "text": "F3F97 \nA systems administrator would like to create a point-in-time backup of a virtual \nmachine. \nWhich of the following should the administrator use?",
    "options": [
      "Replication",
      "Simulation",
      "Snapshot",
      "Containerization"
    ],
    "correct": [
      0,
      4
    ],
    "multi": true
  },
  {
    "id": 97,
    "text": "F3F98 \nA security administrator notices numerous unused, non-compliant desktops are \nconnected to the network. Which of the following actions would the administrator most \nlikely recommend to the management team?",
    "options": [
      "Monitoring",
      "Decommissioning",
      "Patching",
      "Isolating"
    ],
    "correct": [
      1
    ],
    "multi": false
  },
  {
    "id": 98,
    "text": "F3F99 \nWhich of the following is a common data removal option for companies that want to \nwipe \nsensitive data from hard drives in a repeatable manner but allow the hard drives to be \nreused?",
    "options": [
      "Sanitization",
      "Formatting",
      "Degaussing",
      "Defragmentation"
    ],
    "correct": [
      0
    ],
    "multi": false
  },
  {
    "id": 99,
    "text": "F3F100 \nAn organization wants to improve the company's security authentication method for \nremote employees. Given the following requirements: \n-Must work across SaaS and internal network applications \n-Must be device manufacturer agnostic \n-Must have offline capabilities \nWhich of the following would be the most appropriate authentication method?",
    "options": [
      "Username and password",
      "Biometrics",
      "SMS verification",
      "Time-based tokens"
    ],
    "correct": [
      3
    ],
    "multi": false
  }
]